"""
设公鸡数为x、母鸡数为y、小鸡数为z，
根据题意满足：数量约束：(x + y + z = N)（共买N只鸡）
金额约束：5x + 3y + z/3= N（共花N元）
非负整数约束：x,y,z >=0，且z是 3 的倍数（小鸡 3 只 1 元，需整只买）
步骤 2：化简方程将z = N - x - y代入金额约束，化简得：(5x + 3y + {N - x - y/3 = N)
两边乘 3 消分母：(15x + 9y + N - x - y = 3N)
整理得：(14x + 8y = 2N )( 7x + 4y = N)
步骤 3：确定枚举范围由(7x + 4y = N)且(y >= 0)，得x的取值范围是：(0 <= x <=N/7)（x为非负整数）。
对每个x，计算y = (N - 7x)/4，若y是非负整数，则z = N - x - y也为非负整数（且必是 3 的倍数，可验证）。
"""
N = int(input())
count = 0
# 枚举x的可能取值
for x in range(0, N // 7 + 1):
    # 判断y的取值范围，及能否取整
    if N - 7 * x >= 0 and (N - 7 * x) % 4 == 0:
        y = (N - 7 * x) // 4
        z = N - x - y
        print(f"{x} {y} {z}")
        count += 1
if count == 0:
    print("No Anser")